{
  "basics": {
    "label": "+3 years of experience with a strong background in developing Web Applications and working with Open Source technologies.",
    "image": "/profile.png",
    "email": "anibal.alpizar14@gmail.com",
    "url": "https://anibalalpizar.com",
    "summary": [
      "Starting my career in the frontend area. My passion for creating attractive and functional user interfaces led me to master technologies like React, Angular, Next.js, and Astro. Throughout this time, I have worked on a wide variety of projects, ranging from single-page web applications to more complex platforms that require a smooth and efficient user experience.",
      "After solidifying my skills in frontend development, I decided to expand my expertise to the backend to gain a deeper understanding of the full application development cycle. This decision was driven by the need to have more control over data flow and business logic in the applications I was building. I learned to work with Node.js, Express.js, MongoDB, and MySQL, which allowed me to develop more robust and scalable applications.",
      "Finally, by combining my knowledge of frontend and backend, I perfected my skills as a Full Stack Developer. This evolution has enabled me to approach projects holistically, from designing the user interface to implementing business logic and managing databases. I am always on the lookout for new challenges and opportunities to learn emerging technologies and share my knowledge with the community."
    ],
    "location": {
      "city": "Alajuela",
      "countryCode": "CR",
      "region": "Costa Rica"
    },
    "name": "Aníbal Alpízar",
    "profiles": [
      {
        "network": "GitHub",
        "url": "https://github.com/anibalalpizar"
      }
    ]
  },
  "work": [
    {
      "name": "Internship At Tech Solutions",
      "position": "Full Stack Developer",
      "startDate": "2024-04-01",
      "endDate": "2024-08-25"
    },
    {
      "name": "Microsoft Student Ambassador",
      "position": "Student Ambassador",
      "startDate": "2024-01-20",
      "endDate": "2024-08-03"
    },
    {
      "name": "Inventory Management System for Non-Profit",
      "position": "Software Developer",
      "startDate": "2023-03-26",
      "endDate": "2023-08-07"
    },
    {
      "name": "Medical Prescription App Development",
      "position": "Software Developer",
      "startDate": "2022-08-02",
      "endDate": "2022-12-15"
    }
  ]
}
